### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [82]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [35]:
total_players = len(purchase_data.SN.unique())
total_players

576

In [50]:
summary_table1 = pd.DataFrame({"Total Player":[total_players]})
summary_table1

   Total Player
0           576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [16]:
unique_items = len(purchase_data["Item ID"].unique())
unique_items

179

In [15]:
average_price = purchase_data.Price.mean()
average_price

3.050987179487176

In [19]:
total_revenue = purchase_data.Price.sum()
total_revenue

2379.77

In [21]:
purchase_count = len(purchase_data["Purchase ID"])
purchase_count

780

In [51]:
summary_table2 = pd.DataFrame({"Unique_Item_Count":[unique_items],
                          "#_of_Purchase":[purchase_count],
                          "Total_Revenue":[total_revenue],
                          "AVG_Price":[average_price]})
summary_table2["Total_Revenue"] = summary_table2["Total_Revenue"].map("${:,.2f}".format)
summary_table2["AVG_Price"] = summary_table2["AVG_Price"].map("${:,.2f}".format)
summary_table2

   Unique_Item_Count  #_of_Purchase Total_Revenue AVG_Price
0                179            780     $2,379.77     $3.05

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [60]:
gender=purchase_data.groupby("Gender")
unique_gender = gender.nunique()["SN"]
unique_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [61]:
percentage_gender = (unique_gender / total_players)*100
percentage_gender

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [62]:
summary_table3 = pd.DataFrame({"Total_Count":unique_gender,
                              "Gender_Percentage":percentage_gender})
summary_table3["Gender_Percentage"] = summary_table3["Gender_Percentage"].map("{:,.2f}%".format)
summary_table3

                       Total_Count Gender_Percentage
Gender
Female                          81            14.06%
Male                           484            84.03%
Other / Non-Disclosed           11             1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [70]:
gender_count = purchase_data.groupby(["Gender"]).count()["Purchase ID"]
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

## Age Demographics

In [73]:
average_price_gender = purchase_data.groupby(["Gender"]).mean()["Price"]
average_price_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [74]:
total_price_gender = purchase_data.groupby(["Gender"]).sum()["Price"]
total_price_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [75]:
unique_gender_avg = total_price_gender / unique_gender
unique_gender_avg

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [79]:
summary_table4 = pd.DataFrame({"Gender_Count":gender_count,
                             "AVG_Purchase_Gender": average_price_gender,
                             "AVG_Purchase_UniqueID" : unique_gender_avg})
summary_table4["AVG_Purchase_Gender"] = summary_table4["AVG_Purchase_Gender"].map("${:,.2f}".format)
summary_table4["AVG_Purchase_UniqueID"] = summary_table4["AVG_Purchase_UniqueID"].map("${:,.2f}".format)
summary_table4

                       Gender_Count AVG_Purchase_Gender AVG_Purchase_UniqueID
Gender
Female                          113               $3.20                 $4.47
Male                            652               $3.02                 $4.07
Other / Non-Disclosed            15               $3.35                 $4.56

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [93]:
max_age = purchase_data.Age.max()
max_age

45

In [94]:
min_age = purchase_data.Age.min()
min_age

7

In [103]:
age_list = purchase_data.Age.unique()
age_list

array([20, 40, 24, 23, 22, 36, 35, 21, 30, 38, 29, 11,  7, 19, 37, 10,  8,
       18, 27, 33, 32, 25, 12, 34, 17, 15, 13, 26, 16, 28, 31, 39, 44, 41,
        9, 14, 42, 43, 45], dtype=int64)

In [114]:
bins = [0, 15, 21, 25, 30, 35, 45]
group_labels = ["0 - 15", "16 - 21", "22 - 25", "26 - 30", "31 - 35", "36-45"]

In [115]:
pd.cut(purchase_data["Age"], bins, labels=group_labels).head()

0    16 - 21
1      36-45
2    22 - 25
3    22 - 25
4    22 - 25
Name: Age, dtype: category
Categories (6, object): [0 - 15 < 16 - 21 < 22 - 25 < 26 - 30 < 31 - 35 < 36-45]

In [127]:
purchase_data["Age_Range"] = pd.cut(purchase_data["Age"], bins, labels=group_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Raange,Age_Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,16 - 21,16 - 21
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,36-45,36-45
2,2,Ithergue48,24,Male,92,Final Critic,4.88,22 - 25,22 - 25
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,22 - 25,22 - 25
4,4,Iskosia90,23,Male,131,Fury,1.44,22 - 25,22 - 25

In [139]:
age_range_group = purchase_data["Age_Range"].value_counts()
age_range_group

22 - 25    263
16 - 21    262
0 - 15      86
26 - 30     77
31 - 35     52
36-45       40
Name: Age_Range, dtype: int64

In [147]:
age_range_ttl = age_range_group.sum()
age_range_ttl

780

In [149]:
age_group_pct = age_range_group / age_range_ttl*100
age_group_pct

22 - 25    33.717949
16 - 21    33.589744
0 - 15     11.025641
26 - 30     9.871795
31 - 35     6.666667
36-45       5.128205
Name: Age_Range, dtype: float64

In [152]:
summary_table5 = pd.DataFrame({"Age_Range_CT":age_range_group,
                              "Age_Range_PCT":age_group_pct})
summary_table5["Age_Range_PCT"] = summary_table5["Age_Range_PCT"].map("{:,.2f}%".format)
summary_table5

         Age_Range_CT Age_Range_PCT
22 - 25           263        33.72%
16 - 21           262        33.59%
0 - 15             86        11.03%
26 - 30            77         9.87%
31 - 35            52         6.67%
36-45              40         5.13%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [159]:
avg_purchase_agerng = purchase_data.groupby(["Age_Range"]).mean()["Price"]
avg_purchase_agerng

Age_Range
0 - 15     3.087907
16 - 21    3.062214
22 - 25    3.045247
26 - 30    2.875584
31 - 35    2.994423
36-45      3.347000
Name: Price, dtype: float64

In [160]:
total_purchase_agerng = purchase_data.groupby(["Age_Range"]).sum()["Price"]
total_purchase_agerng

Age_Range
0 - 15     265.56
16 - 21    802.30
22 - 25    800.90
26 - 30    221.42
31 - 35    155.71
36-45      133.88
Name: Price, dtype: float64

In [162]:
summary_table6 = pd.DataFrame({"AVG_purchase":avg_purchase_agerng,
                               "TTL_purchase":total_purchase_agerng})
summary_table6["AVG_purchase"] = summary_table6["AVG_purchase"].map("${:,.2f}".format)
summary_table6["TTL_purchase"] = summary_table6["TTL_purchase"].map("${:,.2f}".format)
summary_table6

          AVG_purchase TTL_purchase
Age_Range
0 - 15           $3.09      $265.56
16 - 21          $3.06      $802.30
22 - 25          $3.05      $800.90
26 - 30          $2.88      $221.42
31 - 35          $2.99      $155.71
36-45            $3.35      $133.88

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [172]:
top_spender = purchase_data.groupby(["SN"]).sum()["Price"]
top_5 = top_spender.nlargest(5,"first")
top_5

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
Name: Price, dtype: float64

In [174]:
summary_table7 = pd.DataFrame({"TOP_5_Spenders":top_5})
summary_table7["TOP_5_Spenders"] = summary_table7["TOP_5_Spenders"].map("${:,.2f}".format)
summary_table7

            TOP_5_Spenders
SN
Lisosia93           $18.96
Idastidru52         $15.45
Chamjask73          $13.83
Iral74              $13.62
Iskadarya95         $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [178]:
item_info = purchase_data[['Item ID', 'Item Name', 'Price']]
item_info.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [199]:
item_purchase_ct = item_info.groupby(["Item Name"]).count()["Item ID"]
item_purchase_ct

Item Name
Abyssal Shard                      5
Aetherius, Boon of the Blessed     5
Agatha                             6
Alpha                              3
Alpha, Oath of Zeal                3
                                  ..
Wolf                               8
Wolf, Promise of the Moonwalker    6
Worldbreaker                       4
Yearning Crusher                   3
Yearning Mageblade                 5
Name: Item ID, Length: 179, dtype: int64

In [233]:
item_purchase_avg = item_info.groupby(["Item Name"]).mean()["Price"]
item_purchase_avg.head()

Item Name
Abyssal Shard                     2.67
Aetherius, Boon of the Blessed    3.39
Agatha                            3.08
Alpha                             2.07
Alpha, Oath of Zeal               4.05
Name: Price, dtype: float64

In [234]:
item_purcahse_total = item_info.groupby(["Item Name"]).sum()["Price"]
item_purcahse_total.head()

Item Name
Abyssal Shard                     13.35
Aetherius, Boon of the Blessed    16.95
Agatha                            18.48
Alpha                              6.21
Alpha, Oath of Zeal               12.15
Name: Price, dtype: float64

In [223]:
summary_table8 = pd.DataFrame({ "Purchase_CT":item_purchase_ct,
                              "AVG_Purchase":item_purcahse_avg,
                              "TTL_Purchase":item_purcahse_total})
summary_table8["AVG_Purchase"] = summary_table8["AVG_Purchase"].map("${:,.2f}".format)
summary_table8["TTL_Purchase"] = summary_table8["TTL_Purchase"].map("${:,.2f}".format)
summary_table8.sort_values(by ="Purchase_CT", ascending = False).head()

,Purchase_CT,AVG_Purchase,TTL_Purchase
Item Name,,,
Final Critic,13,$4.61,$59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
Persuasion,9,$3.22,$28.99
Nirvana,9,$4.90,$44.10
"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [232]:
summary_table8 = pd.DataFrame({ "Purchase_CT":item_purchase_ct,
                              "AVG_Purchase":item_purcahse_avg,
                              "TTL_Purchase":item_purcahse_total})
summary_table8["AVG_Purchase"] = summary_table8["AVG_Purchase"].map("${:,.2f}".format)
summary_table8["TTL_Purchase"] = summary_table8["TTL_Purchase"].map("${:,.2f}".format)
summary_table8.sort_values(by ="TTL_Purchase", ascending = False).head()

,Purchase_CT,AVG_Purchase,TTL_Purchase
Item Name,,,
Final Critic,13,$4.61,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,50.76
Nirvana,9,$4.90,44.10
Fiery Glass Crusader,9,$4.58,41.22
Singed Scalpel,8,$4.35,34.80